In [1]:
import pandas as pd,numpy as np

In [2]:
data={'item':['cereles','dairy','frozen','meat'],'price':[100,50,200,259],'hour_1':[5,5,2,8],
     'hour_2':[8,8,2,1],'hour_3':[7,8,7,2]}

In [3]:
df=pd.DataFrame(data,index=[11,22,33,44],dtype=object)

In [17]:
df

       item price hour_1 hour_2 hour_3
11  cereles   100      5      8      7
22    dairy    50      5      8      8
33   frozen   200      2      2      7
44     meat   259      8      1      2

In [23]:
melted=pd.melt(df,id_vars=['item',],value_name=('sales'),var_name='HRS',value_vars=('hour_1','hour_2','hour_3'))

In [24]:
melted

       item     HRS sales
0   cereles  hour_1     5
1     dairy  hour_1     5
2    frozen  hour_1     2
3      meat  hour_1     8
4   cereles  hour_2     8
5     dairy  hour_2     8
6    frozen  hour_2     2
7      meat  hour_2     1
8   cereles  hour_3     7
9     dairy  hour_3     8
10   frozen  hour_3     7
11     meat  hour_3     2

In [29]:
melted.groupby('item')[['HRS']]

In [34]:
melted.groupby('item')['sales'].sum()

item
cereles    20
dairy      21
frozen     11
meat       11
Name: sales, dtype: object

In [35]:
melted.groupby('HRS')['sales'].sum()

HRS
hour_1    20
hour_2    19
hour_3    24
Name: sales, dtype: object

In [36]:
melted.groupby('HRS')['sales'].mean()

HRS
hour_1    5.00
hour_2    4.75
hour_3    6.00
Name: sales, dtype: float64

In [40]:
df['revenue']=df['price']*df['hour_1']*df['hour_2']*df['hour_3']

In [41]:
df

       item price hour_1 hour_2 hour_3 revenue
11  cereles   100      5      8      7   28000
22    dairy    50      5      8      8   16000
33   frozen   200      2      2      7    5600
44     meat   259      8      1      2    4144

In [42]:
melted

       item     HRS sales
0   cereles  hour_1     5
1     dairy  hour_1     5
2    frozen  hour_1     2
3      meat  hour_1     8
4   cereles  hour_2     8
5     dairy  hour_2     8
6    frozen  hour_2     2
7      meat  hour_2     1
8   cereles  hour_3     7
9     dairy  hour_3     8
10   frozen  hour_3     7
11     meat  hour_3     2

In [45]:
melted=pd.melt(df,id_vars=['item','price','revenue'],value_vars=['hour_1','hour_2','hour_3'],var_name='hour',
              value_name='sales')

In [46]:
melted

       item price revenue    hour sales
0   cereles   100   28000  hour_1     5
1     dairy    50   16000  hour_1     5
2    frozen   200    5600  hour_1     2
3      meat   259    4144  hour_1     8
4   cereles   100   28000  hour_2     8
5     dairy    50   16000  hour_2     8
6    frozen   200    5600  hour_2     2
7      meat   259    4144  hour_2     1
8   cereles   100   28000  hour_3     7
9     dairy    50   16000  hour_3     8
10   frozen   200    5600  hour_3     7
11     meat   259    4144  hour_3     2

In [48]:
pivoted=pd.pivot(melted,index=['item','price','revenue'],columns='hour',values='sales')

In [49]:
pivoted

hour                  hour_1 hour_2 hour_3
item    price revenue
cereles 100   28000        5      8      7
dairy   50    16000        5      8      8
frozen  200   5600         2      2      7
meat    259   4144         8      1      2

In [50]:
pivoted.columns

Index(['hour_1', 'hour_2', 'hour_3'], dtype='object', name='hour')

In [51]:
pivoted.index

MultiIndex([('cereles', 100, 28000),
            (  'dairy',  50, 16000),
            ( 'frozen', 200,  5600),
            (   'meat', 259,  4144)],
           names=['item', 'price', 'revenue'])

In [52]:
pivoted.index.names

FrozenList(['item', 'price', 'revenue'])

In [64]:
pivoted=pd.pivot(melted,index='item',columns=['hour'],values=['sales'])

In [65]:
pivoted

         sales
hour    hour_1 hour_2 hour_3
item
cereles      5      8      7
dairy        5      8      8
frozen       2      2      7
meat         8      1      2

In [66]:
pivoted.index.name

'item'

In [67]:
pivoted.columns.names

FrozenList([None, 'hour'])

In [68]:
pivoted

         sales
hour    hour_1 hour_2 hour_3
item
cereles      5      8      7
dairy        5      8      8
frozen       2      2      7
meat         8      1      2

In [74]:
pivoted['price']=melted['price'][:4]

In [75]:
pivoted

         sales               price  rev
hour    hour_1 hour_2 hour_3
item
cereles      5      8      7   NaN  NaN
dairy        5      8      8   NaN  NaN
frozen       2      2      7   NaN  NaN
meat         8      1      2   NaN  NaN

In [76]:
pivoted['rev']=melted['revenue']

In [77]:
pivoted

         sales               price  rev
hour    hour_1 hour_2 hour_3
item
cereles      5      8      7   NaN  NaN
dairy        5      8      8   NaN  NaN
frozen       2      2      7   NaN  NaN
meat         8      1      2   NaN  NaN

In [78]:
melted.price

0     100
1      50
2     200
3     259
4     100
5      50
6     200
7     259
8     100
9      50
10    200
11    259
Name: price, dtype: object

In [80]:
del pivoted['price']

In [81]:
pivoted

         sales                rev
hour    hour_1 hour_2 hour_3
item
cereles      5      8      7  NaN
dairy        5      8      8  NaN
frozen       2      2      7  NaN
meat         8      1      2  NaN

In [82]:
del pivoted['rev']

In [86]:
pivoted.drop(axis=0,labels='meat',inplace=True)

In [87]:
pivoted

         sales
hour    hour_1 hour_2 hour_3
item
cereles      5      8      7
dairy        5      8      8
frozen       2      2      7

In [91]:
pivoted.rename(index={'cereles':1,'dairy':2,'frozen':3})

      sales
hour hour_1 hour_2 hour_3
item
1         5      8      7
2         5      8      8
3         2      2      7

In [92]:
pivoted.rename(columns={'hour_1':'H1','hour_2':'H2'})

        sales
hour       H1 H2 hour_3
item
cereles     5  8      7
dairy       5  8      8
frozen      2  2      7

In [93]:
pd.cut

TypeError: cut() got an unexpected keyword argument 'bin'

In [96]:
qcut=pd.qcut(range(20),5,labels=['a','b','c','d','e'])

In [97]:
qcut

['a', 'a', 'a', 'a', 'b', ..., 'd', 'e', 'e', 'e', 'e']
Length: 20
Categories (5, object): ['a' < 'b' < 'c' < 'd' < 'e']

In [98]:
qcut.shape

(20,)

In [99]:
qcut.value_counts()

a    4
b    4
c    4
d    4
e    4
dtype: int64

In [101]:
qcut

['a', 'a', 'a', 'a', 'b', ..., 'd', 'e', 'e', 'e', 'e']
Length: 20
Categories (5, object): ['a' < 'b' < 'c' < 'd' < 'e']

In [102]:
qcut.codes

array([0, 0, 0, 0, 1, 1, 1, 1, 2, 2, 2, 2, 3, 3, 3, 3, 4, 4, 4, 4],
      dtype=int8)

In [103]:
qcut.categories

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [104]:
import re
# mainly used for math operations

In [105]:
dir(re)

['A',
 'ASCII',
 'DEBUG',
 'DOTALL',
 'I',
 'IGNORECASE',
 'L',
 'LOCALE',
 'M',
 'MULTILINE',
 'Match',
 'Pattern',
 'RegexFlag',
 'S',
 'Scanner',
 'T',
 'TEMPLATE',
 'U',
 'UNICODE',
 'VERBOSE',
 'X',
 '_MAXCACHE',
 '__all__',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__file__',
 '__loader__',
 '__name__',
 '__package__',
 '__spec__',
 '__version__',
 '_cache',
 '_compile',
 '_compile_repl',
 '_expand',
 '_locale',
 '_pickle',
 '_special_chars_map',
 '_subx',
 'compile',
 'copyreg',
 'enum',
 'error',
 'escape',
 'findall',
 'finditer',
 'fullmatch',
 'functools',
 'match',
 'purge',
 'search',
 'split',
 'sre_compile',
 'sre_parse',
 'sub',
 'subn',
 'template']

In [ ]:
re.split

In [ ]:
pd.get_dummies

In [106]:
ser=pd.Series(list('abca'))

In [107]:
pd.get_dummies(ser)

   a  b  c
0  1  0  0
1  0  1  0
2  0  0  1
3  1  0  0

In [108]:
ser

0    a
1    b
2    c
3    a
dtype: object

In [111]:
pd.get_dummies(ser,columns=['a','b','c'],drop_first=True)

   b  c
0  0  0
1  1  0
2  0  1
3  0  0

In [113]:
df=pd.DataFrame({'A':['a','b','c'],'B':['b','a','c'],'C':[1,2,3]},index=list('XYZ'))

In [114]:
df

   A  B  C
X  a  b  1
Y  b  a  2
Z  c  c  3

In [115]:
pd.get_dummies(df,prefix=['col','col'],prefix_sep='@')

   C  col@a  col@b  col@c  col@a  col@b  col@c
X  1      1      0      0      0      1      0
Y  2      0      1      0      1      0      0
Z  3      0      0      1      0      0      1

In [117]:
pd.get_dummies(df,prefix=['colA','colB'],prefix_sep='@',drop_first=True)

   C  colA@b  colA@c  colB@b  colB@c
X  1       0       0       1       0
Y  2       1       0       0       0
Z  3       0       1       0       1

# File Reading And Writing

In [118]:
data = {
    'CHN': {'COUNTRY': 'China', 'POP': 1_398.72, 'AREA': 9_596.96,
            'GDP': 12_234.78, 'CONT': 'Asia'},
    'IND': {'COUNTRY': 'India', 'POP': 1_351.16, 'AREA': 3_287.26,
            'GDP': 2_575.67, 'CONT': 'Asia', 'IND_DAY': '1947-08-15'},
    'USA': {'COUNTRY': 'US', 'POP': 329.74, 'AREA': 9_833.52,
            'GDP': 19_485.39, 'CONT': 'N.America',
            'IND_DAY': '1776-07-04'},
    'IDN': {'COUNTRY': 'Indonesia', 'POP': 268.07, 'AREA': 1_910.93,
            'GDP': 1_015.54, 'CONT': 'Asia', 'IND_DAY': '1945-08-17'},
    'BRA': {'COUNTRY': 'Brazil', 'POP': 210.32, 'AREA': 8_515.77,
            'GDP': 2_055.51, 'CONT': 'S.America', 'IND_DAY': '1822-09-07'},
    'PAK': {'COUNTRY': 'Pakistan', 'POP': 205.71, 'AREA': 881.91,
            'GDP': 302.14, 'CONT': 'Asia', 'IND_DAY': '1947-08-14'},
    'NGA': {'COUNTRY': 'Nigeria', 'POP': 200.96, 'AREA': 923.77,
            'GDP': 375.77, 'CONT': 'Africa', 'IND_DAY': '1960-10-01'},
    'BGD': {'COUNTRY': 'Bangladesh', 'POP': 167.09, 'AREA': 147.57,
            'GDP': 245.63, 'CONT': 'Asia', 'IND_DAY': '1971-03-26'},
    'RUS': {'COUNTRY': 'Russia', 'POP': 146.79, 'AREA': 17_098.25,
            'GDP': 1_530.75, 'IND_DAY': '1992-06-12'},
    'MEX': {'COUNTRY': 'Mexico', 'POP': 126.58, 'AREA': 1_964.38,
            'GDP': 1_158.23, 'CONT': 'N.America', 'IND_DAY': '1810-09-16'},
    'JPN': {'COUNTRY': 'Japan', 'POP': 126.22, 'AREA': 377.97,
            'GDP': 4_872.42, 'CONT': 'Asia'},
    'DEU': {'COUNTRY': 'Germany', 'POP': 83.02, 'AREA': 357.11,
            'GDP': 3_693.20, 'CONT': 'Europe'},
    'FRA': {'COUNTRY': 'France', 'POP': 67.02, 'AREA': 640.68,
            'GDP': 2_582.49, 'CONT': 'Europe', 'IND_DAY': '1789-07-14'},
    'GBR': {'COUNTRY': 'UK', 'POP': 66.44, 'AREA': 242.50,
            'GDP': 2_631.23, 'CONT': 'Europe'},
    'ITA': {'COUNTRY': 'Italy', 'POP': 60.36, 'AREA': 301.34,
            'GDP': 1_943.84, 'CONT': 'Europe'},
    'ARG': {'COUNTRY': 'Argentina', 'POP': 44.94, 'AREA': 2_780.40,
            'GDP': 637.49, 'CONT': 'S.America', 'IND_DAY': '1816-07-09'},
    'DZA': {'COUNTRY': 'Algeria', 'POP': 43.38, 'AREA': 2_381.74,
            'GDP': 167.56, 'CONT': 'Africa', 'IND_DAY': '1962-07-05'},
    'CAN': {'COUNTRY': 'Canada', 'POP': 37.59, 'AREA': 9_984.67,
            'GDP': 1_647.12, 'CONT': 'N.America', 'IND_DAY': '1867-07-01'},
    'AUS': {'COUNTRY': 'Australia', 'POP': 25.47, 'AREA': 7_692.02,
            'GDP': 1_408.68, 'CONT': 'Oceania'},
    'KAZ': {'COUNTRY': 'Kazakhstan', 'POP': 18.53, 'AREA': 2_724.90,
            'GDP': 159.41, 'CONT': 'Asia', 'IND_DAY': '1991-12-16'}
}

columns = ('COUNTRY', 'POP', 'AREA', 'GDP', 'CONT', 'IND_DAY')

In [126]:
df=pd.DataFrame(data).T

In [127]:
df.head(5)

       COUNTRY      POP     AREA       GDP       CONT     IND_DAY
CHN      China  1398.72  9596.96  12234.78       Asia         NaN
IND      India  1351.16  3287.26   2575.67       Asia  1947-08-15
USA         US   329.74  9833.52  19485.39  N.America  1776-07-04
IDN  Indonesia   268.07  1910.93   1015.54       Asia  1945-08-17
BRA     Brazil   210.32  8515.77   2055.51  S.America  1822-09-07

In [129]:
df.isnull().sum()

COUNTRY    0
POP        0
AREA       0
GDP        0
CONT       1
IND_DAY    6
dtype: int64

In [130]:
!ls

pandas_practice_1.ipynb  pandas_practice_3.ipynb
pandas_practice_2.ipynb  pandas_practice_4.ipynb

In [136]:
df.columns

Index(['COUNTRY', 'POP', 'AREA', 'GDP', 'CONT', 'IND_DAY'], dtype='object')

In [137]:
df.to_csv('country_data.csv',na_rep=np.NaN,columns=['COUNTRY','GDP','AREA'])
# WRITE SELECTED COLUMNS TO CSV FILE

In [140]:
df.to_csv('country_data.csv',na_rep=np.NaN,)
# write all cols and also handling missing values

In [139]:
df.to_csv('country_data.csv',na_rep=np.nan,index=False,header=False,chunksize=5)

In [144]:
df=pd.read_csv('country_data.csv',index_col=0)

In [167]:
df=pd.read_csv('country_data.csv',skiprows=[1,2,3,4],index_col=0,nrows=5)

In [168]:
df.head(5)

        COUNTRY     POP      AREA      GDP       CONT     IND_DAY
BRA      Brazil  210.32   8515.77  2055.51  S.America  1822-09-07
PAK    Pakistan  205.71    881.91   302.14       Asia  1947-08-14
NGA     Nigeria  200.96    923.77   375.77     Africa  1960-10-01
BGD  Bangladesh  167.09    147.57   245.63       Asia  1971-03-26
RUS      Russia  146.79  17098.25  1530.75        NaN  1992-06-12

In [169]:
df.shape

(5, 6)

In [170]:
df.size

30

In [171]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, BRA to RUS
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   COUNTRY  5 non-null      object
 1   POP      5 non-null      float64
 2   AREA     5 non-null      float64
 3   GDP      5 non-null      float64
 4   CONT     4 non-null      object
 5   IND_DAY  5 non-null      object
dtypes: float64(3), object(3)
memory usage: 280.0+ bytes

In [172]:
len(df)

5

In [173]:
len(df.columns)

6

In [178]:
df=pd.read_table('country_data.csv',sep=',',index_col=0)

In [179]:
df

        COUNTRY      POP      AREA       GDP       CONT     IND_DAY
CHN       China  1398.72   9596.96  12234.78       Asia         NaN
IND       India  1351.16   3287.26   2575.67       Asia  1947-08-15
USA          US   329.74   9833.52  19485.39  N.America  1776-07-04
IDN   Indonesia   268.07   1910.93   1015.54       Asia  1945-08-17
BRA      Brazil   210.32   8515.77   2055.51  S.America  1822-09-07
PAK    Pakistan   205.71    881.91    302.14       Asia  1947-08-14
NGA     Nigeria   200.96    923.77    375.77     Africa  1960-10-01
BGD  Bangladesh   167.09    147.57    245.63       Asia  1971-03-26
RUS      Russia   146.79  17098.25   1530.75        NaN  1992-06-12
MEX      Mexico   126.58   1964.38   1158.23  N.America  1810-09-16
JPN       Japan   126.22    377.97   4872.42       Asia         NaN
DEU     Germany    83.02    357.11   3693.20     Europe         NaN
FRA      France    67.02    640.68   2582.49     Europe  1789-07-14
GBR          UK    66.44    242.50   2631.23     Europe         NaN
ITA       Italy    60.36    301.34   1943.84     Europe         NaN
ARG   Argentina    44.94   2780.40    637.49  S.America  1816-07-09
DZA     Algeria    43.38   2381.74    167.56     Africa  1962-07-05
CAN      Canada    37.59   9984.67   1647.12  N.America  1867-07-01
AUS   Australia    25.47   7692.02   1408.68    Oceania         NaN
KAZ  Kazakhstan    18.53   2724.90    159.41       Asia  1991-12-16

In [180]:
df.to_csv('tables_country.txt',na_rep=np.nan,chunksize=10,)

In [181]:
df.to_excel('country.xlsx',sheet_name='sheet_1',)

In [184]:
df.to_excel('country.xlsx',sheet_name='sheet_1',na_rep='NaN')

In [185]:
df.to_excel('country.xlsx',sheet_name='country_1',na_rep='NaN',columns=['COUNTRY','AREA','GDP'])

In [186]:
df=pd.read_excel('country.xlsx',sheet_name='country_1',)

In [188]:
df=pd.read_excel('country.xlsx',sheet_name='country_1',index_col=0,)

In [190]:
df=pd.read_excel('country.xlsx',index_col=0,usecols=['COUNTRY','AREA'])

In [192]:
df=pd.read_excel('country.xlsx',index_col=0,skiprows=[2,13,16,9],nrows=15)

In [193]:
df.head(5)

       COUNTRY     AREA       GDP
CHN      China  9596.96  12234.78
USA         US  9833.52  19485.39
IDN  Indonesia  1910.93   1015.54
BRA     Brazil  8515.77   2055.51
PAK   Pakistan   881.91    302.14

In [194]:
len(df)

12

In [195]:
len(df.columns)

3

In [196]:
df.shape

(12, 3)

In [197]:
df.size

36

In [198]:
df=pd.DataFrame(data).T

In [199]:
df.head(5)

       COUNTRY      POP     AREA       GDP       CONT     IND_DAY
CHN      China  1398.72  9596.96  12234.78       Asia         NaN
IND      India  1351.16  3287.26   2575.67       Asia  1947-08-15
USA         US   329.74  9833.52  19485.39  N.America  1776-07-04
IDN  Indonesia   268.07  1910.93   1015.54       Asia  1945-08-17
BRA     Brazil   210.32  8515.77   2055.51  S.America  1822-09-07

In [200]:
df.to_html('country_data..html')
# this create html body only for this dataframe
# it doesn't create fully functional web-page
# so to create full html ,u've to go throgh complete procedure
# whole procedure is below

In [204]:
s=['<html>']
s.append('<head><title>Country_Data</title></head>')
s.append('<body>')
s.append(df.to_html())
s.append('</body></html>')
full_html=''.join(s)
try:
    with open('country_data_full.html','w')as writeto_html:
        writeto_html.write(full_html)
except Exception as e:
    print(str(e)+ 'error occured')

In [201]:
pd.read_html('country_data..html',index_col=0,)

[        COUNTRY      POP      AREA       GDP       CONT     IND_DAY
 CHN       China  1398.72   9596.96  12234.78       Asia         NaN
 IND       India  1351.16   3287.26   2575.67       Asia  1947-08-15
 USA          US   329.74   9833.52  19485.39  N.America  1776-07-04
 IDN   Indonesia   268.07   1910.93   1015.54       Asia  1945-08-17
 BRA      Brazil   210.32   8515.77   2055.51  S.America  1822-09-07
 PAK    Pakistan   205.71    881.91    302.14       Asia  1947-08-14
 NGA     Nigeria   200.96    923.77    375.77     Africa  1960-10-01
 BGD  Bangladesh   167.09    147.57    245.63       Asia  1971-03-26
 RUS      Russia   146.79  17098.25   1530.75        NaN  1992-06-12
 MEX      Mexico   126.58   1964.38   1158.23  N.America  1810-09-16
 JPN       Japan   126.22    377.97   4872.42       Asia         NaN
 DEU     Germany    83.02    357.11   3693.20     Europe         NaN
 FRA      France    67.02    640.68   2582.49     Europe  1789-07-14
 GBR          UK    66.44    242.50   2631.23     Europe         NaN
 ITA       Italy    60.36    301.34   1943.84     Europe         NaN
 ARG   Argentina    44.94   2780.40    637.49  S.America  1816-07-09
 DZA     Algeria    43.38   2381.74    167.56     Africa  1962-07-05
 CAN      Canada    37.59   9984.67   1647.12  N.America  1867-07-01
 AUS   Australia    25.47   7692.02   1408.68    Oceania         NaN
 KAZ  Kazakhstan    18.53   2724.90    159.41       Asia  1991-12-16]

In [211]:
df=pd.read_html('country_data_full.html',index_col=0,parse_dates=['IND_DAY'])

In [212]:
df
# primarly it showing in list data structre

[        COUNTRY      POP      AREA       GDP       CONT    IND_DAY
 CHN       China  1398.72   9596.96  12234.78       Asia        NaT
 IND       India  1351.16   3287.26   2575.67       Asia 1947-08-15
 USA          US   329.74   9833.52  19485.39  N.America 1776-07-04
 IDN   Indonesia   268.07   1910.93   1015.54       Asia 1945-08-17
 BRA      Brazil   210.32   8515.77   2055.51  S.America 1822-09-07
 PAK    Pakistan   205.71    881.91    302.14       Asia 1947-08-14
 NGA     Nigeria   200.96    923.77    375.77     Africa 1960-10-01
 BGD  Bangladesh   167.09    147.57    245.63       Asia 1971-03-26
 RUS      Russia   146.79  17098.25   1530.75        NaN 1992-06-12
 MEX      Mexico   126.58   1964.38   1158.23  N.America 1810-09-16
 JPN       Japan   126.22    377.97   4872.42       Asia        NaT
 DEU     Germany    83.02    357.11   3693.20     Europe        NaT
 FRA      France    67.02    640.68   2582.49     Europe 1789-07-14
 GBR          UK    66.44    242.50   2631.23     Europe        NaT
 ITA       Italy    60.36    301.34   1943.84     Europe        NaT
 ARG   Argentina    44.94   2780.40    637.49  S.America 1816-07-09
 DZA     Algeria    43.38   2381.74    167.56     Africa 1962-07-05
 CAN      Canada    37.59   9984.67   1647.12  N.America 1867-07-01
 AUS   Australia    25.47   7692.02   1408.68    Oceania        NaT
 KAZ  Kazakhstan    18.53   2724.90    159.41       Asia 1991-12-16]

In [215]:
df=df[0]
# converted to dataframe

In [216]:
df.head(5)

       COUNTRY      POP     AREA       GDP       CONT    IND_DAY
CHN      China  1398.72  9596.96  12234.78       Asia        NaT
IND      India  1351.16  3287.26   2575.67       Asia 1947-08-15
USA         US   329.74  9833.52  19485.39  N.America 1776-07-04
IDN  Indonesia   268.07  1910.93   1015.54       Asia 1945-08-17
BRA     Brazil   210.32  8515.77   2055.51  S.America 1822-09-07

In [217]:
len(df)

20

In [218]:
df.shape

(20, 6)

In [219]:
len(df.columns)

6

In [220]:
df.size

120

In [221]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 20 entries, CHN to KAZ
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   COUNTRY  20 non-null     object
 1   POP      20 non-null     float64
 2   AREA     20 non-null     float64
 3   GDP      20 non-null     float64
 4   CONT     19 non-null     object
 5   IND_DAY  14 non-null     datetime64[ns]
dtypes: datetime64[ns](1), float64(3), object(2)
memory usage: 1.1+ KB

In [222]:
table=pd.read_html('https://en.wikipedia.org/wiki/Minnesota')

In [224]:
print(f'total tables: {len(table)}')

total tables: 29

In [225]:
table[1]

                 Minnesota state symbols  \
                         Living insignia
0                                   Bird
1                              Butterfly
2                                   Fish
3                                 Flower
4                               Mushroom
5                                   Tree
6                     Inanimate insignia
7                               Beverage
8                                   Food
9                               Gemstone
10                                 Other
11  Lists of United States state symbols


                                    Living insignia.1
0                                         Common loon
1                                             Monarch
2                                             Walleye
3                       Pink-and-white lady's slipper
4                  Common morel (Morchella esculenta)
5                                      Norway pine[7]
6                                  Inanimate insignia
7                                                Milk
8   Fruit: Honeycrisp appleMuffin: BlueberryMushro...
9                                 Lake Superior agate
10                                  Photograph: Grace
11               Lists of United States state symbols

In [226]:
table[23]
# we have scapped all 29 tables from site

,0,1
0,Pre-New Spainexplorers,Christopher Columbus Ferdinand Magellan Juan S...
1,Explorers andconquistadors,Hernn Corts Juan Ponce de Len Nuo de Guzm...

In [227]:
# if u want to access specific table
table=pd.read_html('https://en.wikipedia.org/wiki/Minnesota',match='Election results from statewide races')

In [228]:
table[0]

    Year     Office    GOP    DFL Others
0   2020  President  45.3%  52.4%   2.3%
1   2020    Senator  43.5%  48.8%   7.7%
2   2018   Governor  42.4%  53.9%   3.7%
3   2018    Senator  36.2%  60.3%   3.4%
4   2018    Senator  42.4%  53.0%   4.6%
5   2016  President  44.9%  46.4%   8.6%
6   2014   Governor  44.5%  50.1%   5.4%
7   2014    Senator  42.9%  53.2%   3.9%
8   2012  President  45.1%  52.8%   2.1%
9   2012    Senator  30.6%  65.3%   4.1%
10  2010   Governor  43.2%  43.7%  13.1%
11  2008  President  43.8%  54.1%   2.1%
12  2008    Senator  42.0%  42.0%  16.0%
13  2006   Governor  46.7%  45.7%   7.6%
14  2006    Senator  37.9%  58.1%   4.0%
15  2004  President  47.6%  51.1%   1.3%
16  2002   Governor  44.4%  33.5%  22.1%
17  2002    Senator  49.5%  47.3%   1.0%
18  2000  President  45.5%  47.9%   6.6%
19  2000    Senator  43.3%  48.8%   7.9%
20  1998   Governor  34.3%  28.1%  37.6%
21  1996  President  35.0%  51.1%  13.9%
22  1996    Senator  41.3%  50.3%   8.4%
23  1994   Governor  63.3%  34.1%   2.6%
24  1994    Senator  49.1%  44.1%   6.8%
25  1992  President  31.9%  43.5%  24.6%

In [229]:
df=table[0]

In [230]:
df.head(4)

   Year     Office    GOP    DFL Others
0  2020  President  45.3%  52.4%   2.3%
1  2020    Senator  43.5%  48.8%   7.7%
2  2018   Governor  42.4%  53.9%   3.7%
3  2018    Senator  36.2%  60.3%   3.4%

In [239]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Year    26 non-null     int64
 1   Office  26 non-null     object
 2   GOP     26 non-null     float64
 3   DFL     26 non-null     object
 4   Others  26 non-null     object
dtypes: float64(1), int64(1), object(3)
memory usage: 1.1+ KB

In [237]:
df['GOP']=df['GOP'].replace('%','',regex=True).astype('float')

In [238]:
df.head(3)

   Year     Office   GOP    DFL Others
0  2020  President  45.3  52.4%   2.3%
1  2020    Senator  43.5  48.8%   7.7%
2  2018   Governor  42.4  53.9%   3.7%

In [ ]:
df=df.r
df[['DFL','Others']]=df[['GOP','Others']].apply(pd.to_numeric)